import 玩家模塊

# 牆
walls = [
    (-2,3), (-1,3), (0,3), (1,3), (2,3), (3,3), (4,3), (5,3),
    (-2,2), (5,2),
    (-4,1), (-2,1), (5,1),
    (-4,0), (5,0),
    (-4,-1), (5,-1),
    (-4,-2), (5,-2),
    (-4,-3),
    (-4,-4), (5,-4),
    (-4,-5), (-3,-5), (-1,-5), (2,-5), (4,-5), (5,-5),
    (-4,-6),(5,-6)]

# 鐵柵欄
iron_fence = [(-4,-7),(5,-7),
    (-4,-8),(-3,-8),(-2,-8),(-1,-8),(0,-8),(1,-8),(2,-8),(3,-8),(4,-8),(5,-8)]

# 窗
window = [
    (-2,-5),(3,-5)
]

# 茶桌
tea_table = [
    (-3,-7)]

# 床
bed = [
    (-1,1),(0,1),(1,1),
    (-1,2),(0,2),(1,2)]

# 出口門
export = [(-3,1)]

# 陽台門
balcony = [
    (0,-5),(1,-5)
]

# 衣櫃
wardrobe = [
    (4,2),(4,1)
]

# 梳妝台
dressing_table = [
    (4,0),(4,-1)
]

# 垃圾桶
trash_bins = [(4,-2)]

# 閣樓
attic = [(5,-3)]

block = {"牆":walls,
           "鐵柵欄":iron_fence,
           "窗":window,
           "茶桌":tea_table,
           "床":bed,
           "門":export,
           "陽台門":balcony,
           "衣櫃":wardrobe,
           "梳妝台":dressing_table,
           "垃圾桶":trash_bins,
           "閣樓":attic}

# for a in block.values():
#     if 玩家模塊.player["面前座標"]:
