#章節資料庫
object_ = {"陽台門":{"封鎖":True,"開啟":False},
           "門":{"封鎖":True,"開啟":False},
           "密碼盒":{"封鎖":True,"開啟":False},
           "抽屜":{"開啟":False,"包含":["手電筒"]},
           "衣櫃":{"包含":{"屍體":{},"紙條":{"存在":True}}},
           "垃圾桶":{"包含":{"紙條?":{"存在":True}}},
           "閣樓":{"包含":{"斧頭":{"存在":True}}},
           "桌子":{"包含":{"抽屜":{"存在":True}}},
           "床":{},
           "鐵柵欄":{},
           "梯子":{},
           "牆壁":{}}
items = {"手電筒":{"電量":10,"位置":"抽屜"},
         "斧頭":{"位置":"閣樓","狀態":"未使用"},
         "紙條":{"位置":"衣櫃"},
         "紙條?":{"位置":"垃圾桶"}}
